app/views/messages/create.json.jbuilder

json.id      @message.id
json.created_at @message.created_at.strftime("%Y年%m月%d日 %H時%M分")
---
INSERT INTO `messages` (`content`, `image`, `group_id`, `user_id`, `created_at`, `updated_at`) VALUES ('', 'ソデ位置.png', 9, 2, '2020-11-10 10:00:08', '2020-11-10 10:00:08')