app/controllers/groups_controller.rb

SELECT  `groups`.* FROM `groups` WHERE `groups`.`id` = 1 LIMIT 1
---
  def edit
    @group = Group.find(params[:id])

SELECT  `groups`.* FROM `groups` WHERE `groups`.`id` = 1 LIMIT 1
UPDATE `groups` SET `name` = 'おひるね', `updated_at` = '2020-11-09 02:42:15' WHERE `groups`.`id` = 1
---
  def update
    @group = Group.find(params[:id])
   if @group.update(group_params)