app/controllers/messages_controller.rb

  def index
    @message = Message.new
    @messages = @group.messages.includes(:user)
---
SELECT  `messages`.* FROM `messages` WHERE `messages`.`group_id` = 1 ORDER BY `messages`.`id` DESC LIMIT 1
SELECT `users`.* FROM `users` INNER JOIN `group_users` ON `users`.`id` = `group_users`.`user_id` WHERE `group_users`.`group_id` = 1

  def create
    @message = @group.messages.new(message_params)
    if @message.save
        respond_to do |format|
          format.json
        end
    else
      @messages = @group.messages.includes(:user)
---
INSERT INTO `messages` (`content`, `group_id`, `user_id`, `created_at`, `updated_at`, `image`) VALUES ('つぎつぎ誘惑芽かおつき。', 9, 7, '2020-11-10 02:22:35', '2020-11-10 02:22:35', NULL)
SELECT  `messages`.* FROM `messages` WHERE `messages`.`group_id` = 1 ORDER BY `messages`.`id` DESC LIMIT 1
SELECT `users`.* FROM `users` INNER JOIN `group_users` ON `users`.`id` = `group_users`.`user_id` WHERE `group_users`.`group_id` = 5