app/controllers/users_controller.rb

  def update
    if current_user.update(user_params)
---
UPDATE `users` SET `name` = 'はるちゃん', `updated_at` = '2020-11-06 09:29:34' WHERE `users`.`id` = 1